TritonDataCenter/illumos-extra/ntp/Solaris/ntptrace.8
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright 2010 Sun Microsystems, Inc.  All rights reserved.
.\" Use is subject to license terms.
.\"
.\" #ident	"@(#)ntptrace.1m	1.2	10/03/16 SMI"
.\"
.TH "ntptrace" "1M" "" "" "System Administration Commands"
.SH NAME
ntptrace \- trace a chain of NTP hosts back to their master time source
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ntptrace\fR [\fB-n\fR] [\fB-m\fR \fImaxhosts\fR] [\fIserver\fR]
.fi
.SH DESCRIPTION
.LP
\fBntptrace\fR determines from where a given Network Time Protocol (\fBNTP\fR) server gets its time, and follows the chain of  \fBNTP\fR servers back to their master time source. If given no arguments, it starts with  \fIlocalhost\fR.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 14n
.rt  
Turns off the printing of host names; instead, host IP addresses are given.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImaxhosts\fR\fR
.ad
.RS 14n
.rt  
Sets the maximum number of levels up the chain that will be followed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample Output From the \fBntptrace\fR Command
.LP
The following example shows the output from the \fBntptrace\fR command:

.sp
.in +2
.nf
% \fBntptrace\fR


 localhost: stratum 4, offset 0.0019529, synch distance 0.144135
 server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
 usndh.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'
.fi
.in -2
.sp

.LP
On each line, the fields are (left to right):

.RS +4
.TP
.ie t \(bu
.el o
The server's host name
.RE
.RS +4
.TP
.ie t \(bu
.el o
The server's stratum
.RE
.RS +4
.TP
.ie t \(bu
.el o
The time offset between that server and the local host (as measured by \fBntptrace\fR; this is why it is not always zero for  \fIlocalhost\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
The host's synchronization distance
.RE
.RS +4
.TP
.ie t \(bu
.el o
The reference clock \fBID\fR (only for stratum-1 servers)
.RE
.LP
All times are given in seconds. Synchronization distance is a measure of the goodness of the clock's time.
.SH NOTES
.LP
Source for \fBntptrace\fR is available on http://src.opensolaris.org.
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/ntp
=
Interface StabilityVolatile
.TE 
.PP
.SH SEE ALSO
.LP
\fBntpq\fR(1M), \fBntpd\fR(1M), \fBntpdc\fR(1M), \fBattributes\fR(5))

